OdGsCollisionDetectionContext.getProcessSignleList
\details
Checks that collision detection should detects collisions between list and all other entities (false)
or it should detect collisions between entities in list (true).
\returns Returns flag that indicates should collision detection detect collisions between entities in list instead of between list and other entities.

OdGsCollisionDetectionContext.setProcessSignleList(System.Boolean)
\details
Specifies should collision detection detects collisions between list and all other entities (false)
or it should detect collisions between entities in list (true).
\param bSet [in] If true, collision detection will detect collisions between entities in list instead of between list and other entities.

OdGsCollisionDetectionContext.getClearance
\details
Retrives collision detection clearance value.
\returns Returns collision detection clearance value.

OdGsCollisionDetectionContext.setClearance(System.Double)
\details
Specifies collision detection clearance value.
\param c [in] Collision detection clearance value.

OdGsCollisionDetectionContext.getCheckAll
\details
Checks that collision detection should check all faces instead of detecting first collision.
\returns Returns flag that indicates should collision detection check all faces instead of detecting first collision.

OdGsCollisionDetectionContext.setCheckAll(System.Boolean)
\details
Specifies that collision detection should check all faces instead of detecting first collision.
\param bSet [in] If true, collision detection will check all faces instead of detecting first collision.

OdGsCollisionDetectionContext.getCalculateDistance
\details
Checks should collision detection calculate distances (penetration depth or distance between objects)
\returns Returns flag that indicates should collision detection calculate distances or not.

OdGsCollisionDetectionContext.setCalculateDistance(System.Boolean)
\details
Specifies that collision detection should also calculate distances (penetration depth or distance between objects)
\param bSet [in] If true, distances will be calculated.

OdGsCollisionDetectionContext.toleranceOverride
\details
Retrives custom collision detection tolerance.
\returns Returns custom collision detection tolerance.

OdGsCollisionDetectionContext.isToleranceOverride
\details
Checks that collision detection should use custom tolerance.
\returns Returns flag that indicates should collision detection use custom tolerance or not.

OdGsCollisionDetectionContext.setToleranceOverride(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Specifies custom collision tolerance.
\param tol [in] Collision tolerance

OdGsCollisionDetectionContext.combineSubEntities
\details
Retrives subentity markers ignoring.
\returns Returns flag that indicates should subentities markers be ignored or not.

OdGsCollisionDetectionContext.setCombineSubEntities(System.Boolean)
\details
Specifies subentity markers ignoring.
\param bSet [in] If true, subentities markers will be ignored.

OdGsCollisionDetectionContext.ignoreViewExtents
\details
Checks whether collisions are detected even if objects are outside view extents.
\returns
true if collisions are detected even if objects are beyond view extents, false otherwise.

OdGsCollisionDetectionContext.setIgnoreViewExtents(System.Boolean)
\details
Specifies whether collisions should be detected despite objects are outside view extents.
\param bSet    [in]  Flag that specifies whether to detected collisions even if objects are beyond view extents.

OdGsCollisionDetectionContext.intersectionWithModel
\details
Retrieves a flag that specifies whether collisions are detected only when objects intersect.
\returns
true if collisions are detected only when objects intersect or false when collisions can be detected via touches.

OdGsCollisionDetectionContext.setIntersectionWithModel(System.Boolean)
\details
Sets flag that specifies whether collisions should be detected with a model.
\param bSet    [in]  Flag that specifies whether to detected collisions with a model.

OdGsCollisionDetectionContext.intersectionOnly
\details
Retrieves a flag that specifies whether collisions are detected only when objects intersect.
\returns
true if collisions are detected only when objects intersect or false when collisions can be detected via touches.

OdGsCollisionDetectionContext.setIntersectionOnly(System.Boolean)
\details
Sets flag that specifies whether collisions are detected only when objects intersect.
\param bSet    [in]  Flag that specifies whether to detect collisions only when objects intersect. If set to false, collisions can be detected via touches (no intersections).

OdGsCollisionDetectionContext.#ctor
\details
Default constructor for the OdGsCollisionDetectionContext class. Sets default tolerance value for geometric operations.